{
  "backend/main.mo": "Main actor implementing user profiles with role-based access control, project and task management with comprehensive features (time tracking, comments, attachments, dependencies, recurring tasks, custom fields), and work submission functionality.",
  "backend/migration.mo": "Migration module that adds submissionTimestamp field to existing Task records, transforming OldTask to NewTask structure while preserving all other fields.",
  "feature_evidence.json": "Feature evidence report documenting implemented features including founder dashboard metrics, task assignment views, employee access control, and work submission functionality with associated files and test IDs.",
  "frontend-file-summaries.txt": "Summaries of frontend components and pages including dashboard, task management, project views, role-based navigation, and various hooks for backend integration.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes including colors for backgrounds, borders, charts, and sidebar components.",
  "frontend/index.html": "HTML entry point for the Team Task Manager application with root div and module script reference.",
  "frontend/src/App.tsx": "Main React application with TanStack Router setup, route guards for admin-only pages, profile setup modal, overdue task notifications, and role-based routing logic.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Reusable access denied component displaying a destructive alert with shield icon and custom error message for unauthorized access attempts.",
  "frontend/src/components/CreateProjectModal.tsx": "A modal dialog component for creating new projects with name and description fields, using a form that generates a unique project ID and calls the useCreateProject hook on submission.",
  "frontend/src/components/CreateTaskModal.tsx": "A comprehensive modal for creating tasks with fields for title, description, assignee, project, dates, priority, dependencies, and recurring task settings, integrating multiple hooks to fetch projects, users, and tasks.",
  "frontend/src/components/CustomFieldDisplay.tsx": "A simple display component that renders custom fields in a two-column grid layout, showing field names and values.",
  "frontend/src/components/CustomFieldInput.tsx": "A reusable input component for custom fields that supports text, number, date, and dropdown types with conditional rendering based on the field type.",
  "frontend/src/components/DashboardMetricsOverview.tsx": "Displays four key metrics (total tasks, completed tasks, completion percentage, and active projects) in a responsive grid of cards with icons and color-coded styling.",
  "frontend/src/components/EmployeeTaskCard.tsx": "A detailed task card component for employees showing task information, progress tracking, time tracking controls, and actions to update progress or submit completed work.",
  "frontend/src/components/Layout.tsx": "The main application layout component with a sticky header, role-based navigation menu, user profile display with role badges, and authentication controls.",
  "frontend/src/components/LoginButton.tsx": "A button component that handles Internet Identity authentication, toggling between login and logout states with loading indicators.",
  "frontend/src/components/OverdueNotificationBadge.tsx": "A notification badge component that displays a bell icon with a count of overdue tasks, hidden when no tasks are overdue.",
  "frontend/src/components/OverdueTaskNotificationModal.tsx": "A modal dialog that automatically appears when users have overdue tasks, listing them with days overdue and providing options to dismiss or view tasks.",
  "frontend/src/components/OverdueTasksList.tsx": "Displays a list of overdue tasks sorted by days overdue, showing task details, assignee, due date, and project. Shows a success message when no tasks are overdue.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for new users to set up their profile by entering name, selecting role (founder/employee), and optionally selecting employee type (teacher/admin). Cannot be dismissed until completed.",
  "frontend/src/components/ProjectList.tsx": "Displays all projects in a responsive grid with progress bars showing completion percentage and task counts. Shows empty state when no projects exist.",
  "frontend/src/components/ProjectProgressCard.tsx": "Card component displaying a single project's name, description, progress bar, and task completion statistics (completed/total tasks).",
  "frontend/src/components/RecurrencePatternDisplay.tsx": "Small component that displays a recurring task's frequency pattern and next occurrence date with a repeat icon.",
  "frontend/src/components/TaskActivityFeed.tsx": "Shows a chronological activity feed for a task including status changes, progress updates, comments, and time entries sorted by timestamp.",
  "frontend/src/components/TaskAssignmentsTable.tsx": "Sortable table displaying task assignments with columns for title, employee, project, due date, priority, and status. Supports sorting by multiple fields and highlights overdue/completed tasks.",
  "frontend/src/components/TaskAttachmentsSection.tsx": "Manages task file attachments with upload functionality (max 10MB), progress tracking, and download buttons for existing attachments using ExternalBlob.",
  "frontend/src/components/TaskCommentsSection.tsx": "Displays a task's comments with author names and timestamps, and provides a form to add new comments with real-time submission feedback.",
  "frontend/src/components/TaskDependencyIndicator.tsx": "Shows task dependencies with completion status indicators, displaying whether a task is blocked by incomplete dependencies.",
  "frontend/src/components/TaskFilterControls.tsx": "Provides UI controls for filtering tasks by priority (with checkboxes) and sorting by priority, due date, or reminder date, with active filter badges.",
  "frontend/src/components/TaskList.tsx": "Renders a list of task cards with details like priority, status, assignee, due date, progress, attachments, and overdue indicators, with links to individual task pages.",
  "frontend/src/components/TaskProgressSlider.tsx": "A simple slider component for adjusting task progress percentage from 0-100% in 5% increments.",
  "frontend/src/components/TasksByEmployeeView.tsx": "Groups and displays tasks organized by assigned employee, showing each employee's task list with priority, status, due dates, and progress indicators.",
  "frontend/src/components/TasksByProjectView.tsx": "Groups and displays tasks organized by project, showing each project's task list with assignee, priority, status, due dates, and progress indicators.",
  "frontend/src/components/TaskTimeLogDisplay.tsx": "Displays total time logged on a task, with optional detailed view showing individual time entries by user with start/end times and durations.",
  "frontend/src/components/TimeTrackingControls.tsx": "React component that displays a timer UI for starting/stopping task time tracking, showing elapsed time with a live-updating clock display.",
  "frontend/src/hooks/useActor.ts": "Custom hook that manages the backend actor instance with authentication, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useAddTaskAttachment.ts": "Mutation hook for adding attachments to tasks, invalidating task-related queries on success.",
  "frontend/src/hooks/useAddTaskComment.ts": "Mutation hook for adding comments to tasks, invalidating task-related queries on success.",
  "frontend/src/hooks/useCreateProject.ts": "Mutation hook for creating new projects with id, name, and description, invalidating the projects list on success.",
  "frontend/src/hooks/useCreateTask.ts": "Mutation hook for creating tasks with full configuration including assignment, priority, dependencies, recurring settings, and custom fields.",
  "frontend/src/hooks/useCreateTaskTemplate.ts": "Mutation hook for creating reusable task templates with priority and custom fields.",
  "frontend/src/hooks/useGetAllProjects.ts": "Query hook that fetches all projects from the backend actor.",
  "frontend/src/hooks/useGetAllTasks.ts": "Query hook that fetches all tasks with automatic refetching every 30 seconds.",
  "frontend/src/hooks/useGetAllTaskTemplates.ts": "Query hook that fetches all task templates from the backend actor.",
  "frontend/src/hooks/useGetAllUsers.ts": "Query hook for fetching all users with principal, name, and role (currently returns empty array).",
  "frontend/src/hooks/useGetAssignedTasks.ts": "Query hook that fetches tasks assigned to the current user with automatic refetching every 30 seconds.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "Query hook that fetches the current authenticated user's profile with enhanced loading state handling.",
  "frontend/src/hooks/useGetCallerUserRole.ts": "Query hook that fetches the current user's role from the backend.",
  "frontend/src/hooks/useGetProjectReport.ts": "Query hook that fetches a project report from the backend actor.",
  "frontend/src/hooks/useGetUserName.ts": "Query hook that fetches a user's name by principal with 5-minute caching.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useOverdueTaskNotification.ts": "Hook that manages overdue task notifications with session-based dismissal tracking.",
  "frontend/src/hooks/useSaveCallerUserProfile.ts": "Mutation hook for saving the current user's profile, invalidating profile and role queries on success.",
  "frontend/src/hooks/useStartTaskTimer.ts": "Mutation hook for starting a task timer, invalidating task queries on success.",
  "frontend/src/hooks/useStopTaskTimer.ts": "Mutation hook for stopping a task timer, invalidating task queries on success.",
  "frontend/src/hooks/useSubmitWorkForTask.ts": "Mutation hook for submitting completed work for a task, invalidating task queries on success.",
  "frontend/src/hooks/useUpdateTaskProgress.ts": "Mutation hook for updating task progress percentage, invalidating task queries on success.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components like backgrounds, borders, charts, and sidebar elements.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication, rendering the main App component.",
  "frontend/src/pages/FounderDashboard.tsx": "Dashboard page for founders/admins displaying project progress cards, task assignments table, metrics overview, overdue tasks, and filterable/sortable task views grouped by project or employee.",
  "frontend/src/pages/GanttChartPage.tsx": "Gantt chart visualization page showing task timelines with progress bars, supporting daily/weekly/monthly zoom levels and displaying task priorities and project associations.",
  "frontend/src/pages/MyTasksPage.tsx": "Employee task page displaying tasks assigned to the current user with filtering by priority and sorting options, using backend authorization to enforce access control.",
  "frontend/src/pages/ProfileSettingsPage.tsx": "User profile management page allowing users to update their name and role type, displaying role badges and admin status with form validation.",
  "frontend/src/pages/ProjectsPage.tsx": "Projects listing page with conditional create project button for admins, displaying all projects using the ProjectList component.",
  "frontend/src/pages/ReportsPage.tsx": "Analytics and reporting page showing completion rate, average task duration, on-time delivery percentage, and productivity trends with export functionality.",
  "frontend/src/pages/TaskDetailPage.tsx": "Displays detailed information for a single task including metadata, progress, comments, activity feed, attachments, dependencies, time logs, and time tracking controls. Provides navigation back to task list and handles loading/not-found states.",
  "frontend/src/pages/TasksPage.tsx": "Main tasks page displaying all tasks with filtering by priority and sorting options (priority, due date, reminder date). Includes task creation modal and uses TaskList component for rendering.",
  "frontend/src/pages/TaskTemplatesPage.tsx": "Manages task templates with a list view and creation dialog. Allows users to create reusable task templates with title, description, and priority settings.",
  "frontend/src/pages/WorkloadViewPage.tsx": "Displays team workload distribution showing active task counts per user with capacity visualization and overload indicators. Uses cards to present each user's workload status.",
  "frontend/src/utils/fileUtils.ts": "Provides utility functions for file handling including formatting file sizes, validating file types against allowed types, and extracting file metadata.",
  "frontend/src/utils/ganttUtils.ts": "Calculates timeline ranges and positioning for Gantt chart visualization of tasks. Determines start/end dates and computes left/width percentages for task bars.",
  "frontend/src/utils/recurrenceUtils.ts": "Formats recurrence patterns from RecurrenceFrequency objects into human-readable strings for daily, weekly, and monthly frequencies.",
  "frontend/src/utils/reportUtils.ts": "Exports report data to JSON format including completion rates, task duration, delivery metrics, and productivity trends with client-side download functionality.",
  "frontend/src/utils/taskUtils.ts": "Comprehensive task utility functions including overdue checking, date formatting, progress calculation, priority-based filtering/sorting, and badge color generation for task priorities.",
  "frontend/src/utils/timeUtils.ts": "Formats time durations into human-readable strings (hours/minutes) and calculates total minutes between bigint timestamps.",
  "frontend/src/utils/urlParams.ts": "Manages URL parameters and session storage for both regular and hash-based routing, including extraction, persistence, and cleanup of URL parameters with support for sensitive data removal.",
  "frontend/src/utils/workloadUtils.ts": "Utility that calculates workload data for users by counting active tasks (progress < 100%) per user and flagging users as overloaded if they have more than 8 active tasks.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, typography, spacing, animations, and theme extensions for a design system with sidebar, chart, and UI component tokens.",
  "project_state.json": "Project metadata describing a school management app with role-based authentication, task/project management, progress tracking, dashboards, and overdue task notifications for founders and employees."
}